{
  "basics": {
    "name": "Matthew Dantas-McCutcheon",
    "label": "Software Engineer",
    "picture": "",
    "email": "mateusdm88@gmail.com",
    "phone": "(202) 753-4966",
		"summary": "",
    "profiles": [
      {
        "network": "Github",
        "username": "mDantas",
        "url": "https://github.com/mDantas"
      }
    ]
  },
  "work": [
    {
      "company": "Vistaprint",
      "position": "Software Engineer, Vistaprint Data Warehouse",
      "website": "n/a",
      "startDate": "2017-10-01",
      "endDate": "2017-09-01",
      "summary": "I worked on Vistaprint's Local Listings product, a tool for small businesses to distribute their contact information far and wide so customers can find them. My contributions spanned a Postgres/Express/React/Node stack with a focus on the backend. I was scrum master for my team, participated in core product decisions, became the app's principal contributor, and am on the on-call rotation.",
      "highlights": [
        "Tech led a team of 3 in the migration from one third-party backend service provider to another. In numbers, the effort spanned about 4 months of effort, ~100 Jira tickets covering work across the stack, and affected ~40k existing users (and all our new signups).",
        "Refactored the application database schema (~6 tables, ~6 views) from update-driven to event-driven so we could better measure customer impact.",
        "From ideation to implementation, introduced a feature to measure customer impact: as a recurring job, search google for our customers' businesses and check the search results for fuzzy matches of customer-identifying information. This involved using Google's custom search engine API, parsing the JSON, and using the Levenshtein algorithm to find closest matches to specified customer business parameters (e.g. name and zip). I've pasted a link to a small, fun open source contribution that resulted from this work.",
				"Wep-API-related engineering: writing request.js-based clients, processing JSON, ad-hoc analysis of 3rd party partner data (curl + jq and then dumping that data to postgres to perform queries across our data & partner data). This was not an isolated project but rather a significant part of the bread-and-butter of working on the Local Listings app.",
				"Internationalization (using react-intl)",
				"Expanding the application's unit test footprint."
      ]
    },
    {
      "company": "Vistaprint",
      "position": "Software Engineer, Local Listings product",
      "website": "https://www.vistaprint.com/digital-marketing/local-listings",
      "startDate": "2015-04-01",
      "endDate": "2017-10-01",
      "summary": "I worked on Vistaprint's Local Listings product, a tool for small businesses to distribute their contact information far and wide so customers can find them. My contributions spanned a Postgres/Express/React/Node stack with a focus on the backend. I was scrum master for my team, participated in core product decisions, became the app's principal contributor, and am on the on-call rotation.",
      "highlights": [
        "A large project that involved designing/leading/implementing the migration of all our users from one third-party backend service provider to another. I met directly with the new 3rd party partners, came up with the architecture to integrate with them, and tech led the migration on a team of ~4 engineers and 2 QE. In numbers, this spanned about 4 months of effort, ~100 Jira tickets, and affected ~40k users.",
        "A medium project to refactor our application database schema to go from an update-driven to an event-driven model so that we could measure the application's effectiveness. This involved updates in application code and schema definition across ~6 tables and the addition of about as many views.",
        "A small/medium project to check our users' appearance in search engine results. This involved using Google's custom search engine API and analysis of the results. I've pasted a link to a small, fun open source contribution that resulted from this work.",
				"Wep-API-related engineering: writing request.js-based clients, processing JSON, ad-hoc analysis of 3rd party partner data (curl + jq and then dumping that data to postgres to perform queries across our data & partner data). This was not an isolated project but rather a significant part of the bread-and-butter of working on the Local Listings app.",
				"Internationalization (using react-intl)",
				"Expanding the application's unit test footprint."
      ]
    },
    {
      "company": "Vistaprint",
      "position": "Software Engineer, Pagemodo product",
      "website": "https://www.vistaprint.com/digital-marketing/local-listings",
      "startDate": "2014-06-01",
      "endDate": "2015-04-01",
      "summary": "Worked on the Pagemodo (http://www.pagemodo.com/) product - a Rails app with postgres backend hosted on Heroku with some Backbone & React on the frontend. My contributions were primarily as an individual feature contributor. My greatest isolated contribution was this experience for Social Media Marketing World 2015: https://www.pagemodo.com/smmw15. This was a vertical slice of work on the stack - wiring up models and controllers, the twitter integration, setting up a backbone app for the image carousel, etc. The \"designer\" that pops open if you click on a design already existed, I just ported it into this experience. I also did not do the html/css on the linked page. My other main contributions during this time included work on pagemodo's teams feature and some work with Apache SOLR to improve our content recommendation.",
      "highlights": [
        "A Twitter-post integrated Backbone SPA for Social Media Marketing World 2015 (https://www.pagemodo.com/smmw15). This was a thin vertical slice of work, adding tables/models, controller, views, and a Backbone app. The post designer to which I integrated the Twitter-posting experience already existed as a core feature of the Pagemodo product.",
        "Pagemodo teams feature - writing Rails controllers and a Backbone spa FIXME - Marionetter",
				"Apache SOLR - FIXME",
				"Sundry bug fixes and small feature tickets."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Maryland, College Park",
      "area": "Mathematics",
      "studyType": "Bachelor of Science",
      "startDate": "2006-09-01",
      "endDate": "2011-05-01",
      "gpa": "3.6",
      "courses": [
        "Real analysis",
				"Quantum physics",
				"Linear algebra",
        "Combinatorics",
        "Cryptology",
				"Computational methods"
      ]
    },
    {
      "institution": "University of Maryland, College Park",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "2006-09-01",
      "endDate": "2011-05-01",
      "gpa": "3.6",
      "courses": [
				"Machine Learning",
        "Algorithms",
        "Systems Architecture"
      ]
    }
  ],
  "awards": [
    {
      "title": "Digital Compression Pioneer Award",
      "date": "2014-11-01",
      "awarder": "Techcrunch",
      "summary": "There is no spoon."
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript"
      ]
    },
    {
      "name": "Compression",
      "level": "Master",
      "keywords": [
        "Mpeg",
        "MP4",
        "GIF"
      ]
    }
  ],
  "languages": [
    {
      "language": "Portuguese",
      "fluency": "Native fluency"
    },
    {
      "language": "French",
      "fluency": "Professional proficiency"
    }
  ],
  "interests": [
    {
      "name": "Wildlife",
      "keywords": [
        "Ferrets",
        "Unicorns"
      ]
    }
  ]
}
